class Constants:
    part_of_speech_map = {
        'NOUN': 'Существительное',
        'ADJF': 'Прилагательное (полное)',
        'ADJS': 'Прилагательное (краткое)',
        'COMP': 'Компаратив',
        'VERB': 'Глагол',
        'INFN': 'Инфинитив',
        'PRTF': 'Причастие (полное)',
        'PRTS': 'Причастие (краткое)',
        'GRND': 'Деепричастие',
        'NUMR': 'Числительное',
        'ADVB': 'Наречие',
        'NPRO': 'Местоимение-существительное',
        'PRED': 'Предикатив',
        'PREP': 'Предлог',
        'CONJ': 'Союз',
        'PRCL': 'Частица',
        'INTJ': 'Междометие',
    }

    animation = {
        'anim': 'одушевленность',
        'inan': 'неодушевленность',
    }

    gender = {
        'masc': 'мужской род',
        'femn': 'женский род',
        'neut': 'средний род',
    }

    number = {
        'sing': 'единственное число',
        'plur': 'множественное число',
    }

    case = {
        'nomn': 'именительный падеж',
        'gent': 'родительный падеж',
        'datv': 'дательный падеж',
        'accs': 'винительный падеж',
        'ablt': 'творительный падеж',
        'loct': 'предложный падеж',
        'voct': 'звательный падеж',
        'gen1': 'первый родительный падеж',
        'gen2': 'второй родительный падеж',
        'acc2': 'второй винительный падеж',
        'loc1': 'первый предложный падеж',
        'loc2': 'второй предложный падеж',
        'ablt2': 'второй творительный падеж',
    }

    degree = {
        'supr': 'превосходная степень',
        'comp': 'сравнительная степень',
    }

    mest = {
        'Qual': 'качественное',
        'Apro': 'местоименное',
        'Anum': 'порядковое',
        'poss': 'притяжательное',
    }

    time = {
        'past': 'прошедшее',
        'pres': 'настоящее',
        'futr': 'будущее'
    }

    type = {
        'impf': 'несовершенный вид',
        'perf': 'совершенный вид'
    }

    inclination = {
        'indc': 'Изъявительное наклонение',
        'impr': 'Повелительное наклонение',
        'cond': 'Условное наклонение',
        'sbst': 'Сослагательное наклонение'
    }





